evem-ndm-vmesnik/xml-primeri/soap/getListEBolRes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Body>
      <getListEBolRes xmlns="http://www.src.si/schemas/evem/ndm/wsdl/20160107"><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<ebol:GetListEBOLResponse xmlns:ebol="http://zzzs.si/b2b/nvg/ZzzsEBOLService" xmlns:wsg="http://zzzs.si/b2b/nsk/wsGlobalTypes"><Glava><Sporocilo><wsg:IdSporocila>577765</wsg:IdSporocila><wsg:VerzijaSporocila>1</wsg:VerzijaSporocila><wsg:StatusIzmenjave>1</wsg:StatusIzmenjave><wsg:SifraSpletneStoritve>49</wsg:SifraSpletneStoritve><wsg:SifraMetodeSpletneStoritve>2</wsg:SifraMetodeSpletneStoritve><wsg:DatumInCas>2019-12-10T08:27:54.325+01:00</wsg:DatumInCas></Sporocilo><UspesnostIzvedbe><VseOk>true</VseOk></UspesnostIzvedbe></Glava><Telo><SteviloStrani>1</SteviloStrani><BolniskiListi><BolniskiList Id="1001680" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-01</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-01</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-01</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-03</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001688" OznakaBolniskegaLista="2" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-04</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-04</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-04</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-06</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001682" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><PovezanaOseba><DtRojstva>2018-02-01</DtRojstva><Ime1>EVITA</Ime1><Priimek1>NADOMESTILO</Priimek1><VrstaPovezaneOsebe Id="12">Otrok</VrstaPovezaneOsebe></PovezanaOseba><Zadrzanost><Dt1DanZadrzanosti>2019-10-07</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-07</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-07</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-09</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="6">NEGA</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001685" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><PovezanaOseba><DtRojstva>2018-02-01</DtRojstva><Ime1>EVITA</Ime1><Priimek1>NADOMESTILO</Priimek1><VrstaPovezaneOsebe Id="12">Otrok</VrstaPovezaneOsebe></PovezanaOseba><Zadrzanost><Dt1DanZadrzanosti>2019-10-10</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-10</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-10</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-11</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="9">SPREMSTVO</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001687" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-14</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-14</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-14</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-16</DtZadrzanostiPolniDo><DtZadrzanostiKrajsiOd>2019-10-17</DtZadrzanostiKrajsiOd><DtZadrzanostiKrajsiDo>2019-10-18</DtZadrzanostiKrajsiDo><StUrDolzanDelati>8.00</StUrDolzanDelati><StUrZadrzan>4.00</StUrZadrzan><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001686" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-21</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-21</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-21</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-22</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001684" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-23</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-23</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiKrajsiOd>2019-10-23</DtZadrzanostiKrajsiOd><DtZadrzanostiKrajsiDo>2019-10-25</DtZadrzanostiKrajsiDo><StUrDolzanDelati>6.00</StUrDolzanDelati><StUrZadrzan>4.00</StUrZadrzan><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001683" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690091</Emso><ZzzsStevilka>911003777</ZzzsStevilka><Ime1>HUBERT</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-28</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-28</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiKrajsiOd>2019-10-28</DtZadrzanostiKrajsiOd><DtZadrzanostiKrajsiDo>2019-10-30</DtZadrzanostiKrajsiDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001655" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102955695108</Emso><ZzzsStevilka>911004801</ZzzsStevilka><Ime1>IVANA</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-01</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-01</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-01</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-05</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001677" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102955695108</Emso><ZzzsStevilka>911004801</ZzzsStevilka><Ime1>IVANA</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-14</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-14</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-14</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-18</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001678" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102955695108</Emso><ZzzsStevilka>911004801</ZzzsStevilka><Ime1>IVANA</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-21</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-21</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiKrajsiOd>2019-10-21</DtZadrzanostiKrajsiOd><DtZadrzanostiKrajsiDo>2019-10-24</DtZadrzanostiKrajsiDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001690" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690059</Emso><ZzzsStevilka>911003690</ZzzsStevilka><Ime1>STAŠ</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-01</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-01</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-01</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-04</DtZadrzanostiPolniDo><DtRecidivOd>2019-09-01</DtRecidivOd><DtRecidivDo>2019-09-10</DtRecidivDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList><BolniskiList Id="1001691" OznakaBolniskegaLista="1" VrstaBolniskegaLista="Z"><Zavarovanec><Emso>0102994690059</Emso><ZzzsStevilka>911003690</ZzzsStevilka><Ime1>STAŠ</Ime1><Priimek1>NADOMESTILO</Priimek1></Zavarovanec><Zadrzanost><Dt1DanZadrzanosti>2019-10-07</Dt1DanZadrzanosti><Dt1DanZadrzanostiZaRazlog>2019-10-07</Dt1DanZadrzanostiZaRazlog><DtZadrzanostiPolniOd>2019-10-07</DtZadrzanostiPolniOd><DtZadrzanostiPolniDo>2019-10-09</DtZadrzanostiPolniDo><RazlogZadrzanosti Id="1">BOLEZEN</RazlogZadrzanosti><SifraZavarovalnePodlage>001000</SifraZavarovalnePodlage></Zadrzanost></BolniskiList></BolniskiListi></Telo></ebol:GetListEBOLResponse>]]></getListEBolRes>
   </soapenv:Body>
</soapenv:Envelope>