evem-ndm-vmesnik/xml-primeri/soap/getEBolReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"   xmlns:ns="http://www.src.si/schemas/evem/ndm/wsdl/20160107">
   <soapenv:Header/>
   <soapenv:Body>
    <ns:getEBol>
		<![CDATA[ <getEBolReq xmlns="http://www.src.si/schemas/evem/ndm/20160107" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.src.si/schemas/evem/ndm/20160107">
			<ms>5000823000</ms>
			<eBolSeznam>
				<eBol>
					<id>1001698</id>
					<oznaka>2</oznaka>
				</eBol>
				<eBol>
					<id>1001742</id>
					<oznaka>1</oznaka>
				</eBol>
				<eBol>
					<id>1001741</id>
					<oznaka>1</oznaka>
				</eBol>
			</eBolSeznam>
			<vpogledovalec>
				<ds>11111119</ds>
				<nazivVpogledovalca>tests</nazivVpogledovalca>
				<namen>tests</namen>
			</vpogledovalec>
		</getEBolReq>]]>
         </ns:getEBol>
   </soapenv:Body>
</soapenv:Envelope>