evem-ndm-vmesnik/xml-primeri/soap/getStatusiVlogReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.src.si/schemas/evem/ndm/wsdl/20160107">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:statusiVlog><![CDATA[ 
      <StatusiVlogReq xmlns="http://www.src.si/schemas/evem/ndm/20160107" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" >
	     <vloga-info evem-st="0702-44-20160518-000002" ms="1447190000"/>
	     <vloga-info evem-st="0702-44-20160518-000003" ms="1447190000"/>
	     <vloga-info evem-st="0702-44-20160518-000004" ms="5554195000"/>
	     <vloga-info evem-st="0702-45-20160620-000001" ms="8719143100"/>
	     <vloga-info evem-st="0702-45-20160620-000010" ms="1234567891"/>
      </StatusiVlogReq>      
      ]]></ns:statusiVlog>
   </soapenv:Body>
</soapenv:Envelope>