evem-ndm-vmesnik/xml-primeri/soap/getListEBolReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.src.si/schemas/evem/ndm/wsdl/20160107">
   <soapenv:Header/>
   <soapenv:Body>
<ns:getListEBol>
		<![CDATA[<getListEBolReq xmlns="http://www.src.si/schemas/evem/ndm/20160107" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.src.si/schemas/evem/ndm/20160107">
	<stran>1</stran>
	<ms>5000823000</ms>
	<obdobjeOd>2019-10-01T00:00:00.0Z</obdobjeOd>
	<obdobjeDo>2019-10-30T23:59:59.0Z</obdobjeDo>
	<letoMesec>
		<leto>2019</leto>
		<mesec>10</mesec>
	</letoMesec>
	<vpogledovalec>
		<ds>00000000</ds>
		<nazivVpogledovalca>String</nazivVpogledovalca>
		<namen>String</namen>
	</vpogledovalec>
	<!--<filter>
		<poslovneEnote>
			<vse>false</vse>
			<ms>5325455001</ms>
		</poslovneEnote>
	</filter>-->
</getListEBolReq>]]>         
 </ns:getListEBol>
   </soapenv:Body>
</soapenv:Envelope>