evem-ndm-vmesnik/xml-primeri/soap/getListMeseciReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.src.si/schemas/evem/ndm/wsdl/20160107">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:getListMeseciEBol>
	<![CDATA[<getListMeseciEBolReq xmlns="http://www.src.si/schemas/evem/ndm/20160107" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.src.si/schemas/evem/ndm/20160107">
	<ms>5000823000</ms>
	<obdobjeOd>2019-10-01T00:00:00.0Z</obdobjeOd>
	<obdobjeDo>2019-10-30T23:59:59.0Z</obdobjeDo>
	<vpogledovalec>
		<ds>11111119</ds>
		<nazivVpogledovalca>test</nazivVpogledovalca>
		<namen>test</namen>
	</vpogledovalec><!--
	<filter>
		<poslovneEnote>
			<vse>false</vse>
			<ms>5325455001</ms>
		</poslovneEnote>
	</filter>-->
</getListMeseciEBolReq>]]>
      </ns:getListMeseciEBol>
   </soapenv:Body>
</soapenv:Envelope>